{
	"latest_version_ios11": 1.6,
	"latest_version_ios12": 1.6,
	"latest_version_ios13": 1.6,
	"beta_version": 1.61,
	"0.1": {
		"url": "https://www.icloud.com/shortcuts/178416923f024497bbc21a4cd1f35d58",
		"version_title": "0.1"
	},
	"0.2": {
		"url": "https://www.icloud.com/shortcuts/56591f224a9e4959b29198a41d554241",
		"version_title": "0.2"
	},
	"0.3": {
		"url": "https://www.icloud.com/shortcuts/6a61425ed07140038275dbe441065173",
		"version_title": "0.3"
	},
	"0.4": {
		"url": "https://www.icloud.com/shortcuts/3f1ba4063bf2406db8180e3479d5e801",
		"version_title": "0.4"
	},
	"0.5": {
		"url": "https://www.icloud.com/shortcuts/4e5229aaae754220823a2d8c85bbbb6f",
		"version_title": "0.5"
	},
	"0.6": {
		"url": "https://www.icloud.com/shortcuts/e0e35140398843d08986356c89307840",
		"version_title": "0.6"
	},
	"1.0": {
		"url": "https://www.icloud.com/shortcuts/3e60738ad2de47af91479370170574e6",
		"version_title": "1.0"
	},
	"1.1": {
		"url": "https://www.icloud.com/shortcuts/d20027d8000d4020aca893e8224f08dd",
		"version_title": "1.1"
	},
	"1.2": {
		"url": "https://www.icloud.com/shortcuts/f8beae7899da499f9fbf8b4027d024c5",
		"version_title": "1.2"
	},
	"1.3": {
		"url": "https://www.icloud.com/shortcuts/91fc645294f64be88ea67c8fb7dfd2a9",
		"version_title": "1.3"
	},
	"1.31": {
		"url": "https://www.icloud.com/shortcuts/84087e3195f64954b78b57ce20276b6e",
		"version_title": "1.3.1"
	},
	"1.4": {
		"url": "https://www.icloud.com/shortcuts/815ad76fcfdd4fe18deada0739897e5e",
		"version_title": "1.4"
	},
	"1.41": {
		"url": "https://www.icloud.com/shortcuts/3dd7be979edc4f719751ef13d6b2f33d",
		"version_title": "1.4.1"
	},
	"1.5": {
		"url": "https://www.icloud.com/shortcuts/29d5472a9d7447e0bef8e98c50a79d21",
		"version_title": "1.5",
		"changelog": "<p style='text-align:center; margin: 5%; font-size: 100%; color: #0B5E9D;'>ok fine here is an update</p><ul style='text-align:justify; font-size:100%; margin: 1%; margin-right: 3%; color: #0B5E9D;'><li>Added a word to the filter list after the longest time</li><li>Objects will now update when their UUID is changed</li><li>You can now edit traits of an ability, such as the name, date of creation, etc.</li><li>Variables will now transfer in presets. However, try to avoid duplicate imports, as duplicate variables will not be removed yet. I will work on that in the future.</li><li>Color Optimization has been adjusted so that your new colors will not be affected by Hopscotch's conversion error</li><li>Your player version can automatically update now. Do note that many complex projects will break through this process though, as there is a timing bug at this moment in time.</li><li>You can now choose to fill blank conditionals, as older player versions still have the blank conditional freeze issue.</li><li>Secret Blocks got some label changing for destroy to adjust to the new update.</li></ul><p style='text-align:center; font-size:150%; margin: 2%; color: #0B5E9D;'></p><br>"
	},
	"1.6": {
		"url": "https://www.icloud.com/shortcuts/22445d000bc54f8794b7b4365a07763f",
		"version_title": "1.6",
		"changelog": "<p style='text-align:center; margin: 5%; font-size: 100%; color: #0B5E9D;'>Should have really done this earlier. Even though you had a Shortcut disclaimer and my warnings, huge apologies to everyone on iOS 13 losing drafts.</p><ul style='text-align:justify; font-size:100%; margin: 1%; margin-right: 3%; color: #0B5E9D;'><li><b>Auto-updating resources!</b> Some features have existed previously, and some are new! These resources will <b>update every time you are online</b>, and saving them into a json file stored in your iCloud Shortcuts folder (which you can access offline if it was synced). Most of the data is pulled from my GitHub Pages, and if that is blocked, no worries; <b>there's a backup</b> that allows you to take new data straight from the old secret post. My shortcut can detect if my page is blocked. However, the forum's whole thing about editing means that the backup source is less reliable, though I will try and keep it updated.</li><ul><li>Secret Blocks will automatically update as they are discovered. There is no need to manually push a shortcut update for these, as they take <b>data straight from a live project draft</b>. The same applies for set image blocks.</li><li>Shortcut <b>status</b> will also be retrieved automatically. This will alert you when a <b>major bug</b> or something of that matter is discovered with the shortcut. You will also be able to see the issue tracker on post 2 of the shortcut topic for this, but if it skips your mind and you run the shortcut, there will be a <b>warning or error</b>, depending on how severe the issue is.</li><li>The <b>filter regex</b> will also be updated on its own! No longer will I need to worry about updating the Shortcut itself to <b>keep its filter regex up to date</b>. Plus, the it was out of date. That is no longer a problem.</li><li><b>Checking for updates</b> has also seen a change in format. This will have little to no effect to you, the user, unless you are far enough into the future (then this will be 1 of 2 updates). Updates have also been moved to Github, like the shortcut status. If it is blocked for you, my shortcut will instead retrieve it from the reference post, so no worries there. In the future, things may change. If I update to iOS 13 and push updates, older versions will not be brought to an incompatible update.</li></ul><li>Usability/Interface improvement. On an iPhone, menu <b>descriptions will no longer be cut off</b>. iPhones now have shortened descriptions when compared to iPad.</li><li><b>MAJOR Bug Fix:</b> iOS 13 users should be able to export their projects safely again. However, this is <b>not guarenteed</b> to work perfectly, so still exercise caution when using the shortcut.</li><li>Objects now support the <b>resize scale</b> modifier, which essentially is the <b>pinch size</b> in the editor. The default scale is 1.</li><li>Presets have had some reworkings in exporting, importing, and file support.</li><ul><li>Presets should once again be able to <b>export normally</b>, no more nonsense from required variable errors.</li><li>Another <b>minor preset bug</b>. Could have been a 0.00001% chance, but Siri Shortcuts had a base64 decode bug (where literally all other decoders worked just fine), and the preset project would randomly cut off at an equals sign in the project. Exports have been tweaked ever so slightly to ensure that this does not happen.</li><li>Presets support <b>zip archives</b> with the extension <b>hsprez</b> (hspre but with a z for zip). You can now compress several presets into one of these and import these into projects like any other presets. Although not supported within the shortcut, you can make a new shortcut that allows selects presets and creates a zip archive from these, with the extension hsprez (the .zip extension will be rejected). However, you still have the ability to import multiple presets at a time, so the preset archive supports are more so for potential downloads in the future that invlove multiple preset files.</li></ul></ul><p style='text-align:center; font-size:150%; margin: 2%; color: #0B5E9D;'></p><br>"
	},
	"1.61": {
		"url": "https://www.icloud.com/",
		"version_title": "1.6.1",
		"changelog": "<p style='text-align:center; margin: 5%; font-size: 100%; color: #0B5E9D;'>Important bug fix. Sorry for the wait (@MISSION_IMPOSSIBLE)</p><ul style='text-align:justify; font-size:100%; margin: 1%; margin-right: 3%; color: #0B5E9D;'><li>Secret Blocks and Image blocks should work once again</li><li>Error Message Support expanded; maybe that will come into effect later.</li><li>Fixed the GitHub update channel; you should be able to receive updated info from there now, though it won't really make a difference unless editing changes again on the forum.</li><li>Upon importing the shortcut, you will be asked to confirm whether you are signed into iCloud for file saving (keeps info up to date when offline). If not, your shortcut will default to included info when offline.</li></ul><p style='text-align:center; font-size:150%; margin: 2%; color: #0B5E9D;'></p><br>"
	}
}
